# Abfragen kombinieren mit UNION, UNION ALL, INTERSECT, EXCEPT

Während JOINs Spalten aus verschiedenen Tabellen zusammenbringen und dabei Zeilen auswählen, je nachdem ob ein INNER oder OUTER JOIN vorliegt, sind nachfolgend demonstrierte Operationen sogenannte **SET Operationen**. _Sie kombinieren Zeilen_ aus unterschiedelichen Abfragen, wobei die Anzahl der Spalten und ihre Datentypen übereinstimmen müssen.

- [UNION](https://learn.microsoft.com/en-us/sql/t-sql/language-elements/set-operators-union-transact-sql?view=sql-server-ver16)
- [EXCEPT and INTERSECT](https://learn.microsoft.com/en-us/sql/t-sql/language-elements/set-operators-except-and-intersect-transact-sql?view=sql-server-ver16)

In [ ]:
-- Beispiele mit Tabellen Mitarbeiter und Kunde
SELECT COUNT(DISTINCT Vorname) AS [Vornamen von Mitarbeitern] FROM Mitarbeiter; -- 10
SELECT COUNT(DISTINCT Vorname) AS [Vornamen von Kunden] FROM Kunde; -- 86

In [ ]:
-- UNION
-- ALLE Vornamen von Mitarbeitern UND Kunden ohne Mehrfachnennung
SELECT Vorname FROM Mitarbeiter
UNION
SELECT Vorname FROM Kunde
ORDER BY Vorname; -- 95 Zeilen

In [ ]:
-- UNION ALL
-- mit Nennung von Duplikaten
SELECT Vorname FROM Mitarbeiter
UNION ALL
SELECT Vorname FROM Kunde
ORDER BY Vorname; -- 102 Zeilen

In [ ]:
-- INTERSECT 
-- Mitarbeiter Vornamen, die AUCH in der Kundenliste vorkommen
SELECT Vorname FROM Mitarbeiter
INTERSECT
SELECT Vorname FROM Kunde
ORDER BY Vorname;

In [ ]:
-- EXCEPT
-- Mitarbeiter Vornamen, die NICHT in der Kundenliste vorkommen
SELECT Vorname FROM Mitarbeiter
EXCEPT 
SELECT Vorname FROM Kunde
ORDER BY Vorname;

In [ ]:
-- Namen von Mitarbeitern und Kunden auflisten, mit Typangabe
SELECT Vorname AS Name, 'Mitarbeiter' AS Typ
FROM Mitarbeiter
UNION
SELECT Vorname, 'Kunde'
FROM Kunde
ORDER BY Name;

In [ ]:
-- Fehler mit Spalten Alias
SELECT Ort AS Stadt -- Alias hier festgelegt
FROM Kunde
UNION
SELECT Ort AS City -- Alias hier wirkungslos, aber Abfrage läuft.
FROM Adresse;

In [ ]:
-- Falsche Anzahl Spalten
/*  Alle Abfragen, die mit einem UNION-, INTERSECT- oder EXCEPT-Operator verbunden werden, 
    müssen gleich viele Ausdrücke in ihren Ziellisten aufweisen. */
SELECT Vorname, Nachname
FROM Mitarbeiter
UNION
SELECT Firma
FROM Kunde;

In [ ]:
-- Unpassende Datentypen
/* Fehler beim Konvertieren einer Zeichenfolge 
	in ein Datum und/oder eine Uhrzeit. */
SELECT Vorname, Geburtsdatum
FROM Mitarbeiter
UNION
SELECT Firma, Ort
FROM Kunde;

In [ ]:
-- Datentypen angeglichen, aber inhaltlich sinnlos
SELECT Vorname, FORMAT(Geburtsdatum, 'd', 'de-de') AS Geburtsdatum
FROM Mitarbeiter
UNION
SELECT Firma, Ort
FROM Kunde;